Revit 2026 API

# Transform2DOfVector Method

---

Applies the transformation to the vector and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV OfVector(
	UV vector
)
```
```vb
Public Function OfVector (
	vector As UV
) As UV
```
```cpp
public:
UV^ OfVector(
	UV^ vector
)
```
```fsharp
member OfVector :
        vector : UV -> UV
```

#### Parameters

vector UV
     The vector to transform.

#### Return Value

UV The transformed vector.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Transformation of a vector is not affected by the translational part of the transformation.

#### Reference

Transform2D Class

Autodesk.Revit.DB Namespace